# 44 - Menata ulang kolom Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Persiapan Data Frame

data frame yang terdiri dari 5 baris dan 5 kolom dengan kolomnya diberi nama A B C D E

untuk isi datanya akan di isi oleh angka yang teracak oleh np.random.randint  dengan size 1 - 10

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size = (n_rows,n_cols)),columns=cols)
df

   A  B  C  D  E
0  6  9  7  7  4
1  5  8  3  5  3
2  6  3  2  9  8
3  5  2  6  4  1
4  4  7  3  7  9

# Menata Ulang Penempatan Kolom pada Data Frame

disini memanggil ulang data frame dengan disertakan nama kolom yang ingin di tampilkan dengan mengacak urutan kolom

In [3]:
df[['D' , 'C' , 'A' , 'E' , 'B']]

   D  C  A  E  B
0  7  7  6  4  9
1  5  3  5  3  8
2  9  2  6  8  3
3  4  6  5  1  2
4  7  3  4  9  7

In [4]:
df

   A  B  C  D  E
0  6  9  7  7  4
1  5  8  3  5  3
2  6  3  2  9  8
3  5  2  6  4  1
4  4  7  3  7  9

jika ingin menampilkan urutan acak di df kita bisa menulis fungsi df= df[['D' , 'C' , 'A' , 'E' , 'B']]

In [5]:
df =df[['D' , 'C' , 'A' , 'E' , 'B']]
df

   D  C  A  E  B
0  7  7  6  4  9
1  5  3  5  3  8
2  9  2  6  8  3
3  4  6  5  1  2
4  7  3  4  9  7